{
  "decks": [
    {
      "created": "null",
      "id": "YBUBNzhYr4s",
      "title": "5 Essential Thai Phrases | EP.8 #igetthais",
      "description": "😃🙏Thanks for watching! If you enjoyed learning about Thai language and culture, don’t forget to give this video a thumbs up and subscribe to I Get Thais. I share fun and practical tips to help you understand Thailand better every week. Hit the bell icon 🔔, so you won’t miss out on new lessons and insights. See you in the next video!\n\nE-mail Jack: jackasoda@gmail.com\n\n👉 Check out online courses here:\n\n💻✨https://www.igetthais.com/\n👍👉 Bundle Offer: Get 2 courses for $145:  https://www.igetthais.com/bundle159/\n👉Reading and Writing Thai $119: https://bit.ly/Igetthaisreading\n👉Sentence Structures for Speaking $46: https://bit.ly/igetthaisstructure\n\nDon't miss out on this amazing opportunity to learn Thai!\n\n00:00 Intro\n00:15 maa gàwn - มาก่อน - to come first\nkrai maa gàwn - ใครมาก่อน - Who came first?\npŏm/chán maa gàwn kráb/kâ - ผม/ฉันมาก่อนครับ/ค่ะ - I came first.\nmaa tŭeng gàwn - มาถึงก่อน - to arrive first\npŏm/chán maa tŭeng gàwn way-laa nád krûeng chûa-mohng - ผม/ฉันมาถึงก่อนเวลานัดครึ่งชั่วโมง - I arrived half an hour before the appointment time.\n  \n03:34 maa tee lăng - มาทีหลัง - to come later\npŏm/chán maa gàwn khun maa tee lăng - ผม/ฉันมาก่อน คุณมาทีหลัง - I came first, you came later.\nkhun maa tŭeng gàwn pŏm/chán maa tŭeng tee lăng - คุณมาถึงก่อน ผม/ฉันมาถึงทีหลัง - You arrived first, I arrived later.\n  \n06:21 tŭeng way-laa - ถึงเวลา - It's time, The time has come.\ntŭeng way-laa bpai tam ngaan láew - ถึงเวลาไปทำงานแล้ว - It's time to go to work.\ntŭeng way-laa kin kâao láew - ถึงเวลากินข้าวแล้ว - It's time to eat\ntŭeng way-laa bpai nawn láew - ถึงเวลาไปนอนแล้ว - It's time to go to bed.\n  \n08:16 dâi way-laa láew - ได้เวลาแล้ว - It's time.\ndâi way-laa bpai tam ngaan láew - ได้เวลาไปทำงานแล้ว - It's time to go to work.\n  \n10:25 mee nád - มีนัด - to have an appointment\nwan aa-tíd née mee nád gàb pûean têe ráan-gaa-fae - วันอาทิตย์นี้มีนัดกับเพื่อนที่ร้านกาแฟ - I have an appointment with a friend at a coffee shop this Sunday.\nprûng-née dtawn sìb mohng wâang mái - พรุ่งนี้ตอน 10 โมงว่างไหม - Are you free tomorrow at 10 AM?\nprûng-née mâi wâang mee nád dtawn sìb mohng  - พรุ่งนี้ไม่ว่าง มีนัดตอน 10 โมง - I'm not free tomorrow, I have an appointment at 10 AM.\n\n#thaiphirases #thaiexpressions #learnthai  #thailearning  #beginnerthai  #speakthai  #conversationstarters  #thaivocabulary"
    }
  ]
}
