{
  "deck": {
	"created": "null"
  },
  "id": "YpBQjqyBKxU",
  "title": "10 Essential Thai Phrases for Everyday Conversation EP:7 #igetthaiswithjack",
  "description": "😃🙏Thanks for watching! If you enjoyed learning about Thai language and culture, don’t forget to give this video a thumbs up and subscribe to I Get Thais. I share fun and practical tips to help you understand Thailand better every week. Hit the bell icon 🔔, so you won’t miss out on new lessons and insights. See you in the next video!\n\nE-mail Jack: jackasoda@gmail.com\n\n👉 Check out online courses here:\n\n💻✨https://www.igetthais.com/\n👍👉 Bundle Offer: Get 2 courses for $145:  https://www.igetthais.com/bundle159/\n👉Reading and Writing Thai $119: https://bit.ly/Igetthaisreading\n👉Sentence Structures for Speaking $46: https://bit.ly/igetthaisstructure\n\nDon't miss out on this amazing opportunity to learn Thai!\n\nRelated Videos:\nไป bpai- มา maa: https://youtu.be/gQ6HbV0ZoRo\nThe word about ว่า(wâa): https://youtu.be/16tkdSFVigY\n\n00:00 Intro\n00:18 1. nâe-nawn แน่นอน Definitely / Certainly / For sure\n\nkhun kíd wâa John jà rean paa-sǎa thai dâi paai nai 50 wan rŭe mâi คุณคิดว่าจอห์นจะเรียนภาษาไทยได้ภายใน 50 วันหรือไม่ Do you think John can learn Thai within 50 days or not?\n\ndâi nâe-nawn ได้แน่นอน Definitely yes\nnâe nâe แน่ ๆ For sure / Absolutely\ndâi yàang nâe-nawn ได้อย่างแน่นอน Absolutely yes\nmâi dâi nâe-nawn ไม่ได้แน่นอน Not definitely / Not certain\nmâi dâi nâe nâe ไม่ได้แน่ ๆ Not for sure / Not absolutely\nmâi dâi yàang nâe-nawn ไม่ได้อย่างแน่นอน Absolutely not\n\n\n03:53 2. wăng wâa หวังว่า Hope that\nwăng wâa John jà rean paa-sǎa thai dâi paai nai 50 wan หวังว่าจอห์นจะเรียนภาษาไทยได้ภายใน 50 วัน Hoping that John can learn Thai within 50 days.\npŏm wăng wâa khun jà kâo-jai ผมหวังว่าคุณจะเข้าใจ I hope you understand.\n\n06:13 3. pìd-plâad ผิดพลาด Mistake / Error\nsùe-săan pìd-plâad สื่อสารผิดพลาด Miscommunication\npìd-plâad dtrong năi ผิดพลาดตรงไหน Where did it go wrong?\nkon rao tam pìd-plâad gan dâi คนเราทำผิดพลาดกันได้ We all make mistakes.\n\n\n09:15 4. mee tú-rá มีธุระ Have something to do / Have an errand\nmee tú-rá gàb pûean มีธุระกับเพื่อน Have something to do with a friend\nprûng-née mee tú-rá dùan dtông bpai tam têe krung-têp พรุ่งนี้มีธุระด่วนต้องไปทำที่กรุงเทพ Tomorrow I have urgent matters and need to go to Bangkok.\n\n11:53 5. kún-kəi คุ้นเคย Familiar \nkún-kəi gàb คุ้นเคยกับ Familiar with\nkún-kəi gàb aa-gàad nai bprà-têt thai คุ้นเคยกับอากาศในประเทศไทย Familiar with the weather in Thailand.\nrao kún-kəi gan เราคุ้นเคยกัน We are familiar with each other.\n\n13:47 6. chin ชิน Get used to\nchin gàb aa-gàad nai bprà-têt thai ชินกับอากาศในประเทศไทย Get used to the weather in Thailand\n\n15:02 7. náe-nam แนะนำ Recommend / Introduce\npŏm jà náe-nam pûean hâi róo-jàg ผมจะแนะนำเพื่อนให้รู้จัก I will introduce my friend to you.\n\nmee menu à-rai náe-nam mái มีเมนูอะไรแนะนำไหม Do you have any recommended menu?\n\npŏm yàag jà náe-nam khun wâa we-laa fùeg pôod hâi jam láe gâw chái bpen pattern rŭe jam phrase mâag gwàa jam kâe kam kam-diaw ผมอยากจะแนะนำคุณว่าเวลาฝึกพูด ให้จำและก็ใช้เป็น pattern หรือจำ phrase มากกว่าจำแค่คำคำเดียว I want to recommend that when practicing speaking, remember and use patterns or phrases more than just individual words.\n\n17:45 8. chái we-laa ใช้เวลา Take time / Use time\nman dtông chái we-laa มันต้องใช้เวลา It takes time.\nchái we-laa ság 2-3 naa-tee ใช้เวลาสัก 2-3 นาที It takes about 2-3 minutes.\nchái we-laa ság 2-3 wan ใช้เวลาสัก 2-3 วัน It takes about 2-3 days.\n\nmâi mee we-laa ไม่มีเวลา No time\n\nwan-née yûng mâag mâi mee we-laa òg-gam-lang-gaai loei วันนี้ยุ่งมาก ไม่มีเวลาออกกำลังกายเลย Today is very busy, no time for exercise at all.\n\n22:14 9. kəi dâi yin mái เคยได้ยินไหม Have you ever heard? / Have you heard before?\n\nkəi dâi yin mái wâa เคยได้ยินไหมว่า Have you ever heard that….?\nkəi dâi yin wâa เคยได้ยินว่า I've heard that...\n\nkəi dâi yin wâa khun yûng mâag mâi mee we-laa òg-gam-lang-gaai châi mǎi เคยได้ยินว่า คุณยุ่งมาก คุณไม่มีเวลาออกกำลังกาย ใช่ไหม  I've heard that you're busy and don't have time to exercise, right?\n\n#thailanguage \n#igetthaiswithjack\n#thaiconversation \n#thailearning \n#learnthai \n#everydaythai\n#thaitravel"
}
